t21/Walnut_X/Packages/.cache/GigaDevice.GD32F1x0_DFP.2.0.1.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>http://gd32mcu.21ic.com/data/documents/yingyongruanjian/</url>
  <name>GD32F1x0_DFP</name>
  <description>GigaDevice GD32F1x0 Series Device Support and Examples</description>
  <releases>
    <release version="2.0.1" date="2016-04-18">
       adjust pack material .
    </release>
    <release version="2.0.0" date="2016-03-01">
      Updated version of GD32F1x0 Device Family Pack.
      Added new devices: GD32F170T4 GD32F170T6 GD32F170T8 GD32F170C4 GD32F170C6 GD32F170C8 GD32F170R8 
                                      GD32F190T4 GD32F190T6 GD32F190T8 GD32F190C4 GD32F190C6 GD32F190C8 GD32F190R4 GD32F190R6 GD32F190R8 GD32F190RB 
    </release>
    <release version="1.0.1">
     Updated device support files.
     Added SVD file.
     Added datasheets, manual.
     Renamed device names.
   </release>
   <release version="1.0.0">
     First Release version of GD32F1 Device Family Pack.
   </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F1x0</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F1x0 Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M3 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <!-- ************************  Subfamily 'GD32F130'  **************************** -->
      <subFamily DsubFamily="GD32F130">
        <processor Dclock="48000000"/>
         <compile header="Device/Include/gd32f1x0.h" define="GD32F1x0 GD32F130_150 USE_STDPERIPH_DRIVER"/>
        <debug svd="SVD/GD32F1x0.svd"/>
        <book name="Documents/GD32F130xx_Datasheet.pdf" title="GD32F130xx Data Sheet"/>
        <description>
        GD32F130 - ARM Cortex-M3 Core
          Frequency up to 48 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider
          NVIC support 16 internal, 52 external interrupts, each has 16 priority levels

        Memories
          Flash size from 16KB to 64 KB
          SRAM size from 4KB to 8 KB with HW parity checking
          3KB ISP loader ROM

        Low power management
          Power saving mode: sleep, deep-sleep, standby mode
          Independent battery supply for real-calendar RTC and backup register

        Advanced analog peripherals
          1 x 12bit, 1us ADC (up to 16 chs)

        Integrated peripherals interface
          Up to 2 x USART/UART/Irda/LIN/ISO7816
          Up to 2 x SPI (18Mbit/s)
          Up to 2 x I2C (400Kbit/s)

        On-chip resources
          1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 1x 32bit GPTM, 2 x WDG
          5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
          System supervisor and reset: POR,PDR,LVD
          80% GPIO available
          32-bit CRC, 96-bit unique ID
         On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'GD32F130C4'  ***************************** -->
        <device Dname="GD32F130C4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130C6'  ***************************** -->
        <device Dname="GD32F130C6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130C8'  ***************************** -->
        <device Dname="GD32F130C8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130F4'  ***************************** -->
        <device Dname="GD32F130F4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G4'  ***************************** -->
        <device Dname="GD32F130G4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G6'  ***************************** -->
        <device Dname="GD32F130G6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130G8'  ***************************** -->
        <device Dname="GD32F130G8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>


        <!-- *************************  Device 'GD32F130K4'  ***************************** -->
        <device Dname="GD32F130K4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F130K6'  ***************************** -->
        <device Dname="GD32F130K6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

