t21/Walnut_X/Packages/.cache/GigaDevice.GD32F1x0_DFP.2.0.1.pdsc
        <!-- *************************  Device 'GD32F150K8'  ***************************** -->
        <device Dname="GD32F150K8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R4'  ***************************** -->
        <device Dname="GD32F150R4">
          <memory    id="IROM1"                   start="0x08000000" size="0x04000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x04000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R6'  ***************************** -->
        <device Dname="GD32F150R6">
          <memory    id="IROM1"                   start="0x08000000" size="0x08000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x01800" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x08000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F150R8'  ***************************** -->
        <device Dname="GD32F150R8">
          <memory    id="IROM1"                   start="0x08000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x10000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F170'  **************************** -->
      <subFamily DsubFamily="GD32F170">
        <processor Dclock="48000000"/>
         <compile header="Device/Include/gd32f1x0.h" define="GD32F1x0 USE_STDPERIPH_DRIVER GD32F170_190"/>
        <debug svd="SVD/GD32F1x0.svd"/>
        <book name="Documents/GD32F170xx_Datasheet.pdf" title="GD32F170xx Data Sheet"/>
        <description>
        GD32F170 - ARM Cortex-M3 Core
          Frequency up to 48 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider
          NVIC support 16 internal, 74 external interrupts, each has 16 priority levels

        Memories
          Flash size from 16KB to 64 KB
          SRAM size from 4KB to 8 KB with HW parity checking
          3KB ISP loader ROM

        Low power management
          Power saving mode: sleep, deep-sleep, standby mode
          Independent battery supply for real-calendar RTC and backup register

        Advanced analog peripherals
          1 x 12bit, 1us ADC (up to 16 chs)

        Integrated peripherals interface
          Up to 2 x USART/UART/Irda/LIN/ISO7816
          Up to 3 x SPI (18Mbit/s)
          Up to 3 x I2C (400Kbit/s)

        On-chip resources
          1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 1x 32bit GPTM, 2 x WDG
          5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
          System supervisor and reset: POR,PDR,LVD
          2 x CAN 2.0B
          80% GPIO available
          32-bit CRC, 96-bit unique ID
          On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'GD32F170C4'  ***************************** -->
        <device Dname="GD32F170C4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1" />
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170C6'  ***************************** -->
        <device Dname="GD32F170C6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170C8'  ***************************** -->
        <device Dname="GD32F170C8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170T4'  ***************************** -->
        <device Dname="GD32F170T4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170T6'  ***************************** -->
        <device Dname="GD32F170T6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

