t21/Walnut_X/Packages/.cache/GigaDevice.GD32F1x0_DFP.2.0.1.pdsc
        <!-- *************************  Device 'GD32F170T8'  ***************************** -->
        <device Dname="GD32F170T8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F170R8'  ***************************** -->
        <device Dname="GD32F170R8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'GD32F190'  **************************** -->
      <subFamily DsubFamily="GD32F190">
        <processor Dclock="72000000"/>
        <compile header="Device/Include/gd32f1x0.h" define="GD32F1x0 USE_STDPERIPH_DRIVER GD32F170_190"/>
        <debug svd="SVD/GD32F1x0.svd"/>        
        <book name="Documents/GD32F190xx_Datasheet.pdf" title="GD32F190xx Data Sheet"/>
        <description>
        GD32F190 - ARM Cortex-M3 Core
           Frequency up to 72 MHz
           Flash access zero wait state
           Single-cycle multiplier and hardware divider
           NVIC support 16 internal, 74 external interrupts, each has 16 priority levels

         Memories
            Flash size from 16KB to 128 KB
            SRAM size from 4KB to 8 KB with HW parity checking
            3KB ISP loader ROM

          Low power management
            Power saving mode: sleep, deep-sleep, standby mode
            Independent battery supply for real-calendar RTC and backup register

          Advanced analog peripherals
            1 x 12bit, 1us ADC (up to 16 chs)
            2 x 12-bit DAC
            2 x fast rail-to-rail low-power comparators

          Integrated peripherals interface
            Up to 2 x USART/UART/Irda/LIN/ISO7816
            Up to 3 x SPI (18Mbit/s), 2 x I2S multiplexed
            Up to 3 x I2C (400Kbit/s)
            Up to 2 x CAN 2.0B
            HDMI-CEC
            Touch sensing interface (TSI, supports up to 18 external electrodes)

          On-chip resources
            1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 1x 32bit GPTM, 1 x Basic Timer, 2 x WDG
            5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs, DAC and I2Ss
            System supervisor and reset: POR,PDR,LVD
            80% GPIO available
            32-bit CRC, 96-bit unique ID,OPAMP,LCD
            On-chip clock: HSI (8MHz), LSI (40KHz)
        </description>

        <!-- *************************  Device 'GD32F190C4'  ***************************** -->
        <device Dname="GD32F190C4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190C6'  ***************************** -->
        <device Dname="GD32F190C6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190C8'  ***************************** -->
        <device Dname="GD32F190C8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F190R4'  ***************************** -->
        <device Dname="GD32F190R4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R6'  ***************************** -->
        <device Dname="GD32F190R6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190R8'  ***************************** -->
        <device Dname="GD32F190R8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190RB'  ***************************** -->
        <device Dname="GD32F190RB">
          <memory id="IROM1"                      start="0x08000000" size="0x00020000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_128.FLM" start="0x08000000" size="0x00020000" default="1"/>   
        </device>

        <!-- *************************  Device 'GD32F190T4'  ***************************** -->
        <device Dname="GD32F190T4">
          <memory id="IROM1"                      start="0x08000000" size="0x00004000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T6'  ***************************** -->
        <device Dname="GD32F190T6">
          <memory id="IROM1"                      start="0x08000000" size="0x00008000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00001800"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F190T8'  ***************************** -->
        <device Dname="GD32F190T8">
          <memory id="IROM1"                      start="0x08000000" size="0x00010000"  startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x20000000" size="0x00002000"  init   ="0" default="1"/>
          <algorithm name="Flash/GD32F1x0_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
     </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <!-- Device Conditions -->
    <condition id="GD32F1x0">
      <description>GigaDevice GD32F1x0 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F1[3579]0*"/>
      <require Cclass="Device" Cgroup="Startup" />
      <require Cclass="Device" Cgroup="System_GD32F1x0" />
    </condition>
    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F1x0 CMSIS">
      <description>GigaDevice GD32F1x0 Devices and CMSIS-CORE</description>
      <require condition="GD32F1x0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>              
    </condition>
